Revit 2027 API
ImporterIFC.ProcessIFCProject(IFCAnyHandle, IDictionary<IFCAnyHandle, ElementId>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ProcessIFCProject(
	IFCAnyHandle ifcProject,
	IDictionary<IFCAnyHandle, ElementId> createdElements
)
Public Sub ProcessIFCProject (
	ifcProject As IFCAnyHandle,
	createdElements As IDictionary(Of IFCAnyHandle, ElementId)
)
public:
void ProcessIFCProject(
	IFCAnyHandle^ ifcProject,
	IDictionary<IFCAnyHandle^, ElementId^>^ createdElements
)
member ProcessIFCProject :
        ifcProject : IFCAnyHandle *
        createdElements : IDictionary<IFCAnyHandle, ElementId> -> unit
Parameters
ifcProject IFCAnyHandle
createdElements IDictionary<IFCAnyHandle, ElementId>
See Also
Reference
ImporterIFC Class
ProcessIFCProject Overload
Autodesk.Revit.DB.IFC Namespace